?- mia = mia
true

?- mia = vincent
false

?- X = Y
X = Y
true

?- X = mia
X = mia
true

?- f(X, Y) = X
X = f(X, Y)
true

?- vertical(line(point(1, 1), point(1, 3))) = vertical(line(point(X, Y), point(X, Z)))
Y = 1
Z = 3
X = 1
true

?- vertical(line(point(X, Y), point(X, Z))) = vertical(line(point(1, 1), point(2, 3)))
false

?- food(bread, X) = food(Y, sausage)
Y = bread
X = sausage
true

?- food(bread, X) = food(Y, bread)
Y = bread
X = bread
true

?- meal(food(f1(f2(f3(Y)))), X) = meal(X, food(f1(f2(f3(Y)))))
X = food(f1(f2(f3(Y))))
true

?- meal(food(f1(f2(f3(100)))), X) = meal(X, food(f1(f2(f3(10)))))
false

